tiborsimon/embedded-tdd-headers/pic/8bit/pic18f4539_tdd.h
#define LVDEN                         522
#define IRVST                         523
#define OSCCON                        524
#define SCS                           525
#define T0CON                         526
#define T0PS                          527
#define T0PS0                         528
#define T0PS1                         529
#define T0PS2                         530
#define PSA                           531
#define T0SE                          532
#define T0CS                          533
#define T08BIT                        534
#define TMR0ON                        535
#define STATUS                        536
#define C                             537
#define CARRY                         538
#define DC                            539
#define ZERO                          540
#define Z                             541
#define OV                            542
#define OVERFLOW                      543
#define N                             544
#define NEGATIVE                      545
#define INTCON3                       546
#define INT1IF                        547
#define INT1F                         548
#define INT2IF                        549
#define INT2F                         550
#define INT1E                         551
#define INT1IE                        552
#define INT2IE                        553
#define INT2E                         554
#define INT1P                         555
#define INT1IP                        556
#define INT2IP                        557
#define INT2P                         558
#define INTCON2                       559
#define RBIP                          560
#define INT3P                         561
#define TMR0IP                        562
#define T0IP                          563
#define INTEDG3                       564
#define INTEDG2                       565
#define INTEDG1                       566
#define INTEDG0                       567
#define RBPU                          568
#define NOT_RBPU                      569
#define nRBPU                         570
#define INTCON                        571
#define RBIF                          572
#define INT0F                         573
#define INT0IF                        574
#define T0IF                          575
#define TMR0IF                        576
#define RBIE                          577
#define INT0E                         578
#define INT0IE                        579
#define T0IE                          580
#define TMR0IE                        581
#define PEIE                          582
#define PEIE_GIEL                     583
#define GIEL                          584
#define GIE_GIEH                      585
#define GIE                           586
#define GIEH                          587
#define STKPTR0                       588
#define STKPTR                        589
#define STKPTR1                       590
#define STKPTR2                       591
#define STKPTR3                       592
#define STKPTR4                       593
#define STKUNF                        594
#define STKFUL                        595

#endif // _PIC18F4539_H_
